### Task 1 - Installing and importing modules (Pandas)

##### 1. Write a command to install the pandas library in your environment.

Note: It’s important to install pandas because it provides data structures and data analysis tools for the Python programming language.

Python raw would not need the % or !
Depending on the verison of Jupyter Notebook a % or ! will be needed

In [1]:
# %pip install pandas

##### 2. Write a command to install a specific version (2.1.1) of pandas.

Note: Sometimes, you might need to work with a specific version of pandas due to compatibility issues with other libraries or specific features available in that version

In [2]:
%pip install pandas==2.1.1

Requirement already satisfied: pandas==2.1.1 in c:\users\lucyknight\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\lucyknight\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas==2.1.1) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lucyknight\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas==2.1.1) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\lucyknight\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas==2.1.1) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\lucyknight\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas==2.1.1) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\lucyknight\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas==2.1.1) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 24.3.1
[notice] To update, run: C:\Users\LucyKnight\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

##### 3. Write a command to import the pandas library as ‘pd’.

Note: It’s a common convention to import pandas as pd. This makes your code shorter and more readable.

In [3]:
import pandas as pd

##### 4. Write a command to create a pandas Series named ‘fruits’ with the values [‘apple’, ‘banana’, ‘cherry’].

Note: A Series is a one-dimensional labeled array capable of holding any data type. It is one of the basic structures in pandas.

In [2]:
import pandas as pd

fruits = pd.Series(['apple', 'banana', 'cherry'])

print(fruits)

0     apple
1    banana
2    cherry
dtype: object

##### 5. Create a DataFrame named ‘purchases’ with two columns ‘apples’ and ‘oranges’.

```
The ‘apples’ column should have the values [3, 2, 0, 1] and the ‘oranges’ column should have the values [0, 3, 7, 2].
```

Note: DataFrames are two-dimensional size-mutable, potentially heterogeneous tabular data structures with labeled axes (rows and columns). They are one of the fundamental structures in pandas.

In [3]:
import pandas as pd

data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

### Task 2 - Data Loading in Pandas

##### 1. Write a line of code to open the ‘employees.csv’ data file into a pandas DataFrame.

```
The employees.csv file will need to be in the same directory(folder) as the notebook, or the filepath will need to be added.
```

Note: This function is useful for loading CSV data into a pandas DataFrame, which is a two-dimensional labeled data structure with columns of potentially different types. It’s one of the most common initial steps in data analysis.

In [6]:
import pandas as pd
df = pd.read_csv('employees.csv')

##### 2. Write a line of code to display the first 5 rows of the DataFrame.

Note: The .head(n) function is useful for quickly previewing the first n rows of your DataFrame, which can help you get a sense of your data at a glance.

In [7]:
df.head(5)
# or print(df.head(5))
# will show a less formatted verison of the output

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Raymond,Indiana,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,Andrade,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,Gutierrez,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Yates,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
4,austin,49.0,Naperville,96000.0,NaN,Turner,IL,20-09-1979,1974-10-13 14:21:44.568274

##### 3. Write a line of code to display the last 3 rows of the DataFrame.

Note: The .tail(n) function is useful for quickly viewing the last n rows of your DataFrame. This can be particularly helpful when you want to see the most recent entries in a time-series dataset.

In [8]:
df.tail(3)

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
157,Laura,28.0,Pittsburgh,53000.0,male,Jackson,Pennsylvania,1991-05-05,1995-10-08 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Hernandez,Florida,03-01-1985,1969-10-14 14:21:44.568274
159,Jennifer,38.0,san francisco,58000.0,NaN,Palmer,CA,2017-01-31,1985-10-10 14:21:44.568274

##### 4. Write a line of code to randomly select 7 rows from the DataFrame.

Note: The .sample(n) function is useful when you want to randomly select n rows from your DataFrame. This can be helpful for creating random samples from your data for tasks like bootstrapping or cross-validation.

In [9]:
df.sample(7)

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
143,Bobby,49.0,Aurora,31000.0,Male,Smith,IL,1988-04-07,1974-10-13 14:21:44.568274
45,Lori,56.0,jacksonville,189000.0,Female,Gibbs,Florida,2014-04-11,1967-10-15 14:21:44.568274
94,tracy,58.0,houston,25000.0,Female,Hays,TX,2017-10-19,1965-10-15 14:21:44.568274
124,carol,27.0,tampa,35000.0,NaN,Jones,Florida,2013-04-23,1996-10-07 14:21:44.568274
115,elizabeth,51.0,miami,57000.0,female,Nunez,Florida,1986-11-04,1972-10-13 14:21:44.568274
81,Teresa,50.0,San Antonio,110000.0,female,Johnson,TX,2017-10-19,1973-10-13 14:21:44.568274
51,andrew,43.0,NaN,131000.0,male,Garcia,NaN,1986-11-04,1980-10-11 14:21:44.568274

##### 5. Write a line of code to save the DataFrame back to a new CSV file named ‘new_employees.csv’.

```
df.to_csv('new_employees.csv', index=False)
```

index=False tells the function not to write the row index to file.

Note: The .to_csv() function is useful for saving your DataFrame back to a CSV file. This is often used after you’ve made some modifications to your data and want to save the results for later use.

In [10]:
df.to_csv('new_employees.csv', index=False)

##### 6. Write a line of code to open a CSV file named ‘separator.csv’ that uses a semicolon (;) as the separator.

Note: In CSV files, a separator (also known as a delimiter) is used to distinguish between different fields.

The most common separator is a comma, but other characters can be used as well, such as semicolons, tabs (\t), spaces, etc.

The choice of separator can depend on the data itself (for example, if the data contains commas within fields, a different separator might be used).

When reading a CSV file with pandas, you can specify the separator using the sep parameter in the read_csv function.

If not specified, pandas will assume the separator is a comma.

It’s important to know what separator is used in your data file to correctly load it into a DataFrame.

In [4]:
import pandas as pd
separator_df = pd.read_csv('separator.csv', sep=';')
separator_df.head(5)

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Raymond,Indiana,1990-12-09,1964-10-15
1,Luis,31.0,Los Angeles,58000.0,NaN,Andrade,CA,1992-02-24,1992-10-08
2,katherine,46.0,Naperville,146000.0,female,Gutierrez,IL,21-12-2015,1977-10-12
3,robert,25.0,pittsburgh,66000.0,Male,Yates,Pennsylvania,1993-01-25,1998-10-07
4,austin,49.0,Naperville,96000.0,NaN,Turner,IL,20-09-1979,1974-10-13

##### 7. Write a line of code to get the shape of the DataFrame.

Note: The .shape attribute is useful for quickly finding out how many rows and columns are in your DataFrame. It returns a tuple in the format (rows, columns).

In [12]:
df.shape

(160, 9)

##### 8. Write a line of code to get a summary of the DataFrame’s numerical columns.

Note: The .describe() function is useful for quickly generating descriptive statistics that summarize the central tendency, dispersion, and shape of a dataset’s distribution. It automatically excludes NaN values.

In [13]:
df.describe()

              Age         Salary
count  159.000000     159.000000
mean    40.773585   86503.144654
std     11.125250   40741.835280
min     20.000000   23000.000000
25%     32.000000   54000.000000
50%     41.000000   77000.000000
75%     50.000000  115000.000000
max     59.000000  191000.000000

##### 9. Write a line of code to get a concise summary of the DataFrame.

Note: The .info() function is useful for getting a quick description of the data, especially the total number of non-null observations and the data type of each column.

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         160 non-null    object
 1   Age          159 non-null    float64
 2   City         156 non-null    object
 3   Salary       159 non-null    float64
 4   Gender       118 non-null    object
 5   column1      158 non-null    object
 6   State        156 non-null    object
 7   Start Date   158 non-null    object
 8   DateOfBirth  160 non-null    object
dtypes: float64(2), object(7)
memory usage: 11.4+ KB

##### 10. Write a line of code to get the number of unique values in each column.

Note: The .nunique() function is useful for understanding the number of distinct values in each column. This can help identify columns with high cardinality.

In [15]:
df.nunique()

Name           129
Age             40
City            46
Salary          91
Gender           7
column1        126
State            9
Start Date      30
DateOfBirth     49
dtype: int64

##### 11. Write a line of code to select all data from the ‘Age’ column.

Note: Selecting a single column from your DataFrame is useful when you want to analyze or manipulate that specific column of data.

In [16]:
df['Age']

0      59.0
1      31.0
2      46.0
3      25.0
4      49.0
       ...
155    38.0
156    35.0
157    28.0
158    54.0
159    38.0
Name: Age, Length: 160, dtype: float64

##### 12.  Write a line of code to calculate the mean age.

Note: The .mode() function is used to find the most frequently occurring value(s) in a series. This can be useful when analyzing categorical data or certain types of numerical data.

In [17]:
df['Age'].mode()

0    54.0
Name: Age, dtype: float64

##### 13. Write a line of code to find the median salary.

Note: The .median() function is used to find the middle value in a series when it’s sorted in ascending order. This can be more informative than the mean for datasets with skewed distributions or outliers.

In [18]:
df['Salary'].median()

77000.0

### Task 3: Data Cleaning in Pandas

##### 1. Write a line of code to drop the ‘column1’ from the DataFrame.

Note: The .drop() function is useful for removing rows or columns by label names and corresponding axis, or by specifying directly index or column names.

In [19]:
df = df.drop(columns=['column1'])
df

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Indiana,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
4,austin,49.0,Naperville,96000.0,NaN,IL,20-09-1979,1974-10-13 14:21:44.568274
...,...,...,...,...,...,...,...,...
155,Jennifer,38.0,san francisco,58000.0,NaN,CA,2017-01-31,1985-10-10 14:21:44.568274
156,Sean,35.0,Los Angeles,70000.0,Male,CA,2011-07-06,1988-10-09 14:21:44.568274
157,Laura,28.0,Pittsburgh,53000.0,male,Pennsylvania,1991-05-05,1995-10-08 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Florida,03-01-1985,1969-10-14 14:21:44.568274
159,Jennifer,38.0,san francisco,58000.0,NaN,CA,2017-01-31,1985-10-10 14:21:44.568274

##### 2. Write a line of code to fill missing values in the ‘Age’ column with the average age.

```
This demonstrates the function of the mean function and utlises imputation, but does it make sense to create an Employees age from a Mean? In this situation it would be better to request a real age for an employee from the data source, or remove that emplyee if it is histroical data.
```

Note: The .fillna() function is used to fill NA/NaN values using the specified method which can be a constant or a DataFrame method like mean, median etc.

In [20]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Indiana,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
4,austin,49.0,Naperville,96000.0,NaN,IL,20-09-1979,1974-10-13 14:21:44.568274
...,...,...,...,...,...,...,...,...
155,Jennifer,38.0,san francisco,58000.0,NaN,CA,2017-01-31,1985-10-10 14:21:44.568274
156,Sean,35.0,Los Angeles,70000.0,Male,CA,2011-07-06,1988-10-09 14:21:44.568274
157,Laura,28.0,Pittsburgh,53000.0,male,Pennsylvania,1991-05-05,1995-10-08 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Florida,03-01-1985,1969-10-14 14:21:44.568274
159,Jennifer,38.0,san francisco,58000.0,NaN,CA,2017-01-31,1985-10-10 14:21:44.568274

##### 3. Write a line of code to drop rows with any missing values.

Note: The .dropna() function is used to remove missing values. It’s useful when you want to discard any incomplete data.

In [31]:
df = df.dropna()
df

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,kyle,59.0,Indianapolis,151000.0,Other,Raymond,IN,1990-12-09,1964-10-15 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,Gutierrez,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,Pittsburgh,66000.0,Male,Yates,PA,1993-01-25,1998-10-07 14:21:44.568274
5,christopher,48.0,Buffalo,47000.0,other,Carroll,NY,1990-12-09,1975-10-13 14:21:44.568274
6,michelle,45.0,Fort Wayne,61000.0,Male,Anderson,IN,1991-05-05,1978-10-12 14:21:44.568274
...,...,...,...,...,...,...,...,...,...
151,brooke,46.0,Dallas,51000.0,Male,Wilson,TX,1999-05-26,1977-10-12 14:21:44.568274
153,Felicia,47.0,San Antonio,110000.0,Female,Willis,TX,2013-04-23,1976-10-12 14:21:44.568274
154,Kevin,39.0,Tucson,91000.0,male,Graham,AZ,2006-07-11,1984-10-10 14:21:44.568274
156,Sean,35.0,Los Angeles,70000.0,Male,Harris,CA,2011-07-06,1988-10-09 14:21:44.568274
157,Laura,28.0,Pittsburgh,53000.0,male,Jackson,PA,1991-05-05,1995-10-08 14:21:44.568274

##### 4. Write a line of code to find duplicated rows.

Note: The .duplicated() function returns a Boolean Series denoting duplicate rows. It’s useful when you want to identify any repeated data in your DataFrame.

In [22]:
df = df.drop_duplicates()
df

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Indiana,1990-12-09,1964-10-15 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
5,christopher,48.0,Buffalo,47000.0,other,NY,1990-12-09,1975-10-13 14:21:44.568274
6,michelle,45.0,Fort Wayne,61000.0,Male,Indiana,1991-05-05,1978-10-12 14:21:44.568274
...,...,...,...,...,...,...,...,...
144,Theresa,53.0,evansville,30000.0,male,Indiana,2013-04-23,1970-10-14 14:21:44.568274
145,jennifer,44.0,Tucson,74000.0,Other,AZ,1992-02-24,1979-10-12 14:21:44.568274
146,Taylor,33.0,Mesa,103000.0,female,AZ,2017-01-31,1990-10-09 14:21:44.568274
147,Jacqueline,22.0,allentown,150000.0,Male,Pennsylvania,1999-05-26,2001-10-06 14:21:44.568274
149,Tammy,54.0,Phoenix,29000.0,Female,AZ,1986-11-04,1969-10-14 14:21:44.568274

##### 5. Write a line of code to drop duplicated rows.

Note: The .drop_duplicates() function is used to remove duplicate rows. This is often necessary in data cleaning process to get rid of repeated information.

In [23]:
df = df.drop_duplicates()
df

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Indiana,1990-12-09,1964-10-15 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
5,christopher,48.0,Buffalo,47000.0,other,NY,1990-12-09,1975-10-13 14:21:44.568274
6,michelle,45.0,Fort Wayne,61000.0,Male,Indiana,1991-05-05,1978-10-12 14:21:44.568274
...,...,...,...,...,...,...,...,...
144,Theresa,53.0,evansville,30000.0,male,Indiana,2013-04-23,1970-10-14 14:21:44.568274
145,jennifer,44.0,Tucson,74000.0,Other,AZ,1992-02-24,1979-10-12 14:21:44.568274
146,Taylor,33.0,Mesa,103000.0,female,AZ,2017-01-31,1990-10-09 14:21:44.568274
147,Jacqueline,22.0,allentown,150000.0,Male,Pennsylvania,1999-05-26,2001-10-06 14:21:44.568274
149,Tammy,54.0,Phoenix,29000.0,Female,AZ,1986-11-04,1969-10-14 14:21:44.568274

6. Write a line of code to replace ‘Illinois’ with ‘IL’ in the ‘State’ column.

Note: The .str.replace() function is used to replace a specified phrase with another specified phrase. It’s useful when you want to standardize the data in your DataFrame.

In [24]:
df['State'] = df['State'].str.replace('Illinois', 'IL')
df

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Indiana,1990-12-09,1964-10-15 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
5,christopher,48.0,Buffalo,47000.0,other,NY,1990-12-09,1975-10-13 14:21:44.568274
6,michelle,45.0,Fort Wayne,61000.0,Male,Indiana,1991-05-05,1978-10-12 14:21:44.568274
...,...,...,...,...,...,...,...,...
144,Theresa,53.0,evansville,30000.0,male,Indiana,2013-04-23,1970-10-14 14:21:44.568274
145,jennifer,44.0,Tucson,74000.0,Other,AZ,1992-02-24,1979-10-12 14:21:44.568274
146,Taylor,33.0,Mesa,103000.0,female,AZ,2017-01-31,1990-10-09 14:21:44.568274
147,Jacqueline,22.0,allentown,150000.0,Male,Pennsylvania,1999-05-26,2001-10-06 14:21:44.568274
149,Tammy,54.0,Phoenix,29000.0,Female,AZ,1986-11-04,1969-10-14 14:21:44.568274

##### 7. Write a line of code to find all rows where ‘City’ contains ‘naperville’.

Note: The .str.contains() function is used to test if pattern or regex is contained within a string of a Series or Index. It’s useful when you want to filter your data based on certain text criteria.

In [25]:
naperville_rows = df[df['City'].str.contains('naperville', na=False)]
naperville_rows

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
12,Nicole,41.0,naperville,78000.0,Other,IL,2006-07-11,1982-10-11 14:21:44.568274
65,tyler,20.0,naperville,113000.0,male,IL,1988-04-07,2003-10-06 14:21:44.568274

##### 8. Write a line of code to standardize the ‘City’ and ‘State’ columns in the DataFrame. For ‘City’, replace ‘naperville’ with ‘Naperville’, and for ‘State’, replace ‘Illinois’ with ‘IL’.

Note: The .str.replace() function is used to replace a specified phrase with another specified phrase. It’s useful when you want to standardise the data in your DataFrame. In this case, we’re using it to ensure that city and state names follow a consistent format. This is an important step in data cleaning, especially when dealing with text data, as it ensures that the same entity is represented in the same way across the dataset.

In [26]:
# Standardising city names
df['City'] = df['City'].str.replace('naperville', 'Naperville')

# Standardising state names
df['State'] = df['State'].str.replace('Illinois', 'IL')
df

,Name,Age,City,Salary,Gender,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Indiana,1990-12-09,1964-10-15 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,pittsburgh,66000.0,Male,Pennsylvania,1993-01-25,1998-10-07 14:21:44.568274
5,christopher,48.0,Buffalo,47000.0,other,NY,1990-12-09,1975-10-13 14:21:44.568274
6,michelle,45.0,Fort Wayne,61000.0,Male,Indiana,1991-05-05,1978-10-12 14:21:44.568274
...,...,...,...,...,...,...,...,...
144,Theresa,53.0,evansville,30000.0,male,Indiana,2013-04-23,1970-10-14 14:21:44.568274
145,jennifer,44.0,Tucson,74000.0,Other,AZ,1992-02-24,1979-10-12 14:21:44.568274
146,Taylor,33.0,Mesa,103000.0,female,AZ,2017-01-31,1990-10-09 14:21:44.568274
147,Jacqueline,22.0,allentown,150000.0,Male,Pennsylvania,1999-05-26,2001-10-06 14:21:44.568274
149,Tammy,54.0,Phoenix,29000.0,Female,AZ,1986-11-04,1969-10-14 14:21:44.568274

##### 9. (OPTIONAL) Write a line of code to standardize the ‘City’ and ‘State’ columns in the DataFrame.

Advanced Question - do not worry if you cannot complete this one now.

```
Reload employees.csv in and output solution to a DataFrame named 'city_state_corrected_df'

Any Unknown city or states should be filled with an 'Unknown' string.

Run the first code block to create mapping dictionaries for States and City. You can choose to use these or manually type out each state and city and what they should be
```

In [27]:
# City to State mapping
city_state = {
    'New York': 'New York',
    'Buffalo': 'New York',
    'Rochester': 'New York',
    'Los Angeles': 'California',
    'San Francisco': 'California',
    'San Diego': 'California',
    'Houston': 'Texas',
    'San Antonio': 'Texas',
    'Dallas': 'Texas',
    'Jacksonville': 'Florida',
    'Miami': 'Florida',
    'Tampa': 'Florida',
    'Chicago': 'Illinois',
    'Aurora': 'Illinois',
    'Naperville': 'Illinois',
    'Philadelphia': 'Pennsylvania',
    'Pittsburgh': 'Pennsylvania',
    'Allentown': 'Pennsylvania',
    'Phoenix': 'Arizona',
    'Tucson': 'Arizona',
    'Mesa': 'Arizona',
    'Indianapolis': 'Indiana',
    'Fort Wayne': 'Indiana',
    'Evansville': 'Indiana'
}

# Abbreviations for some states
state_abbr = {
    'New York': 'NY',
    'California': 'CA',
    'Texas': 'TX',
    'Florida': 'FL',
    'Illinois': 'IL',
    'Pennsylvania': 'PA',
    'Arizona': 'AZ',
    'Indiana': 'IN'
}

In [28]:
# read_csv the employees.csv into the correctly named DataFrame here
import pandas as pd
df = pd.read_csv('employees.csv')
df.head(3)

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,kyle,59.0,indianapolis,151000.0,Other,Raymond,Indiana,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,Andrade,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,Gutierrez,IL,21-12-2015,1977-10-12 14:21:44.568274

In [29]:
# Strip leading/trailing whitespace and capitalize city names
df['City'] = df['City'].str.strip().str.title()

# Replace city names with standardized state names
df['State'] = df['City'].map(city_state)

# If 'State' is still None after the mapping, this means the city was not found in the city_state dictionary.
# We can assume these are the entries with 'City' being None or whitespace (since we've already cleaned other cities).
# We'll replace these with a placeholder value.
df['State'] = df['State'].fillna('Unknown')

# Strip leading/trailing whitespace and capitalize state names
df['State'] = df['State'].str.strip().str.title()

# Replace full state names with abbreviations
df['State'] = df['State'].map(state_abbr)

# If 'State' is still None after the mapping, this means the state was not found in the state_abbr dictionary.
# We'll replace these with a placeholder value.
df['State'] = df['State'].fillna('Unknown')
df

,Name,Age,City,Salary,Gender,column1,State,Start Date,DateOfBirth
0,kyle,59.0,Indianapolis,151000.0,Other,Raymond,IN,1990-12-09,1964-10-15 14:21:44.568274
1,Luis,31.0,Los Angeles,58000.0,NaN,Andrade,CA,1992-02-24,1992-10-08 14:21:44.568274
2,katherine,46.0,Naperville,146000.0,female,Gutierrez,IL,21-12-2015,1977-10-12 14:21:44.568274
3,robert,25.0,Pittsburgh,66000.0,Male,Yates,PA,1993-01-25,1998-10-07 14:21:44.568274
4,austin,49.0,Naperville,96000.0,NaN,Turner,IL,20-09-1979,1974-10-13 14:21:44.568274
...,...,...,...,...,...,...,...,...,...
155,Jennifer,38.0,San Francisco,58000.0,NaN,Palmer,CA,2017-01-31,1985-10-10 14:21:44.568274
156,Sean,35.0,Los Angeles,70000.0,Male,Harris,CA,2011-07-06,1988-10-09 14:21:44.568274
157,Laura,28.0,Pittsburgh,53000.0,male,Jackson,PA,1991-05-05,1995-10-08 14:21:44.568274
158,kiara,54.0,Tampa,33000.0,NaN,Hernandez,FL,03-01-1985,1969-10-14 14:21:44.568274
159,Jennifer,38.0,San Francisco,58000.0,NaN,Palmer,CA,2017-01-31,1985-10-10 14:21:44.568274

##### 10. (OPTIONAL) Perform Data Cleaning on the Gender Column.

### Task 4: Data Manipulation

##### 1. Write a line of code to apply a function that adds 5% to each value in the Salary column

```
A lambda function would make the code more readable here.
```

Note: The .apply() function is useful for applying a function along an axis of the DataFrame. It can be used with a lambda function, as in this case, to perform operations on each element in a column.

In [32]:
df['Salary'] = df['Salary'].apply(lambda x: int(x) * 1.05)

C:\Users\LucyKnight\AppData\Local\Temp\ipykernel_16992\1535121525.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Salary'] = df['Salary'].apply(lambda x: int(x) * 1.05)

##### 2. Write a line of code to apply a function that converts all names in the ‘Name’ column to uppercase.

Note: The .apply() function can be used with string methods to perform operations on each string in a column, e.g. .upper().

In [40]:
df['Name'] = df['Name'].apply(lambda x: x.upper())

##### 3. Write a line of code to concatenate df and df2 along rows.

```
# Creating a second DataFrame
data2 = {
    'Name': ['John', 'Jane'],
    'Age': [30, 25],
    'City': ['New York', 'Los Angeles'],
    'Salary': [70000, 80000],
    'Gender': ['Male', 'Female'],
    'column1': ['Doe', 'Doe'],
    'State': ['NY', 'CA'],
    'Start Date': ['2010-01-01', '2012-07-01'],
    'DateOfBirth': ['1990-01-01', '1997-07-01']
}
df2 = pd.DataFrame(data2)
```

Note: The pd.concat() function is useful for concatenating two or more pandas objects along a particular axis. By default, it concatenates along rows (i.e., axis=0). This is often used when you want to append rows from one DataFrame to another.

In [ ]:
import pandas as pd

# Define the dataframe 1
data = {
    'Name': ['joseph', 'Joshua', 'yvonne', 'nicole', 'Adam'],
    'Age': [44.0, None, 49.0, 27.0, 47.0],
    'City': ['naperville', 'aurora', None, 'Rochester', 'fort wayne'],
    'Salary': [105000.0, 154000.0, 35000.0, 54000.0, 72000.0],
    'Gender': ['other', None, 'Female', 'Other', None],
    'column1': ['Holmes', 'Young', 'Martin', 'Zuniga', 'Ramirez'],
    'State': ['Illinois', 'Illinois', None, 'New York', 'IN'],
    'Start Date': ['2014-10-16', '2002-05-06', '1994', '1999-05-21', '2021-04-10'],
    'DateOfBirth': ['1979-10-12', '2023-05-21', '1974-10-13 00:00:00', '1996-10-07', '1976-10-12']
}

# Convert the dictionary into a DataFrame
df = pd.DataFrame(data)
df

In [ ]:
# Creating a second DataFrame
data2 = {
    'Name': ['John', 'Jane'],
    'Age': [30, 25],
    'City': ['New York', 'Los Angeles'],
    'Salary': [70000, 80000],
    'Gender': ['Male', 'Female'],
    'column1': ['Doe', 'Doe'],
    'State': ['NY', 'CA'],
    'Start Date': ['2010-01-01', '2012-07-01'],
    'DateOfBirth': ['1990-01-01', '1997-07-01']
}
df2 = pd.DataFrame(data2)
df2

In [ ]:
# Concatenating df and df2 along rows (default axis=0)
df3 = pd.concat([df, df2])
df3

##### 4. Write a line of code to concatenate df and df2 along columns.

Note: By specifying axis=1 in the pd.concat() function, you can concatenate DataFrames along columns instead of rows. This is useful when you want to add new columns to a DataFrame from another DataFrame with the same index.

In [ ]:
# Concatenating df and df2 along columns (axis=1)
df3 = pd.concat([df, df2], axis=1)
df3

##### 5. Write a line of code to concatenate df and df2, and ignore the original index.

Note: The ignore_index=True parameter in the pd.concat() function is useful when you want to ignore the original index and reset it in the resulting DataFrame. This is often used when the index does not contain any meaningful information.

In [ ]:
# Concatenating df and df2 and ignoring the original index
df3 = pd.concat([df, df2], ignore_index=True)
df3

### Task 5 (Homework): Joins

In [46]:
import pandas as pd

# Create dataframes function

def create_joins_df():
    # Creating DataFrame df1
    data1 = {
        'ID': list(range(1, 21)),
        'Name': ['Employee'+str(i) for i in range(1, 21)],
        'Department': ['Sales', 'Marketing', 'HR', 'Sales', 'IT', 'Marketing', 'HR', 'IT', 'Sales', 'Marketing',
                    'HR', 'IT', 'Sales', 'Marketing', 'HR', 'IT', 'Sales', 'Marketing', 'HR', 'IT'],
        'Start_Date': pd.date_range(start='01-01-2020', periods=20),
        'Salary': [i*1000 for i in range(50, 70)]
    }
    df1 = pd.DataFrame(data1)

    # Creating DataFrame df2
    data2 = {
        'Identifier': list(range(11, 31)),
        'Role': ['Role'+str(i) for i in range(11, 31)],
        'Years_of_Experience': [i for i in range(1, 21)]
    }
    df2 = pd.DataFrame(data2)

    return df1, df2

In [47]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

In [ ]:
df1

In [ ]:
df2

##### 1. Write a line of code to perform an inner join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='inner' is useful for combining two DataFrames based on a common column, and only keeping rows that have matching values in both DataFrames.

In [ ]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Performing an inner join on 'ID'
df3 = df1.merge(df2, left_on='ID', right_on='Identifier', how='inner')
df3

##### 2. Write a line of code to perform an outer join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='outer' is useful for combining two DataFrames based on a common column, and keeping all rows from both DataFrames.

In [ ]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Performing an outer join on 'ID'
df3 = df1.merge(df2, left_on='ID', right_on='Identifier', how='outer')
df3

##### 3. Write a line of code to join df1 and df2 on different column names (‘ID’ in df1 and ‘Identifier’ in df2).

Note: The merge() function with left_on and right_on parameters is useful for combining two DataFrames based on different column names.

In [ ]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Joining on different column names
df3 = df1.merge(df2, left_on='ID', right_on='Identifier')
df3

##### 4. Write a line of code to join df1 and df2 on their indices.

Note: The join() function is useful for combining two DataFrames based on their indices.

In [ ]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Joining on indices
df3 = df1.join(df2, how='inner', lsuffix='_df1', rsuffix='_df2')
df3

##### 5. Write a line of code to perform a left join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='left' is useful for combining two DataFrames based on a common column, and keeping all rows from the left DataFrame.

In [ ]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Performing a left join on 'ID'
df3 = df1.merge(df2, left_on='ID', right_on='Identifier', how='left')
df3

##### 6. Write a line of code to perform a right join of df1 and df2 on the ‘ID’ column.

Note: The merge() function with how='right' is useful for combining two DataFrames based on a common column, and keeping all rows from the right DataFrame.

In [55]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Performing a right join on 'ID'
df3 = df1.merge(df2, left_on='ID', right_on='Identifier', how='right')

##### 7. Write a line of code to join df1 and df2 on the ‘ID’ column, where ‘ID’ is the index in df1 and a regular column in df2.

Note: The combination of the .set_index() function and the .join() function is useful when you want to join two DataFrames based on an index in one DataFrame and a regular column in another DataFrame.

In [ ]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Joining on index in df1 and regular column in df2
df3 = df1.set_index('ID').join(df2.set_index('Identifier'), how='inner').reset_index()
df3

##### 8. Write a line of code to join df1 and df2, where ‘ID’ is a regular column in both DataFrames, but treat it as an index only for the purpose of joining.

Note: The combination of the .set_index(), .join(), and .reset_index() functions is useful when you want to join two DataFrames based on a common column, but don’t want this column to be the index in your resulting DataFrame.

In [ ]:
# Run DataFrame creation function
df1, df2 = create_joins_df()

# Joining on 'ID' treated as index
df3 = df1.set_index('ID').join(df2.set_index('Identifier'), how='inner').reset_index()
df3